# Medical Manuscript Helper

医学论文助手

## 导入数据

In [39]:
import pandas
data = pandas.read_csv('./titanic/train.csv')

#### 根据数据调节显示参数

In [40]:
# pandas.set_option('precision', 4)

#### 行数，列数

In [41]:
data.shape

(891, 12)

#### 前十项数据

In [42]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

#### 数据描述

In [43]:
data.describe()

       PassengerId  Survived    Pclass       Age     SibSp     Parch      Fare
count     891.0000  891.0000  891.0000  714.0000  891.0000  891.0000  891.0000
mean      446.0000    0.3838    2.3086   29.6991    0.5230    0.3816   32.2042
std       257.3538    0.4866    0.8361   14.5265    1.1027    0.8061   49.6934
min         1.0000    0.0000    1.0000    0.4200    0.0000    0.0000    0.0000
25%       223.5000    0.0000    2.0000   20.1250    0.0000    0.0000    7.9104
50%       446.0000    0.0000    3.0000   28.0000    0.0000    0.0000   14.4542
75%       668.5000    1.0000    3.0000   38.0000    1.0000    0.0000   31.0000
max       891.0000    1.0000    3.0000   80.0000    8.0000    6.0000  512.3292